In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame(np.random.randn(5,4))
df.iloc[::3] = np.nan

In [10]:
df

          0         1         2         3
0       NaN       NaN       NaN       NaN
1  0.030881 -1.333411  0.158074  0.262179
2 -0.387748  0.915119  0.938223 -0.805779
3       NaN       NaN       NaN       NaN
4 -0.535832  0.322435  1.189767 -2.035854

In [11]:
df = df.dropna()

In [12]:
df

          0         1         2         3
1  0.030881 -1.333411  0.158074  0.262179
2 -0.387748  0.915119  0.938223 -0.805779
4 -0.535832  0.322435  1.189767 -2.035854

In [13]:
df.reset_index(drop=True)

          0         1         2         3
0  0.030881 -1.333411  0.158074  0.262179
1 -0.387748  0.915119  0.938223 -0.805779
2 -0.535832  0.322435  1.189767 -2.035854